OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_ecdh.c
/**
 * Copyright (c) 2018 - 2019, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#include <stdio.h>
#include <stdarg.h>
#include <string.h>
#include <stddef.h>
#include "nrf_gpio.h"
#include "nrf_delay.h"
#include "nrf_error.h"
#include "app_util.h"
#include "nrf_section.h"
#include "nrf_crypto.h"
#include "common_test.h"

/**@brief ECDH test vectors can be found on NIST web pages.
 *
 * http://read.pudn.com/downloads168/doc/772358/TestVectorsforSEC%201-gec2.pdf
 * https://csrc.nist.gov/Projects/Cryptographic-Algorithm-Validation-Program/Component-Testing
 */

#if NRF_CRYPTO_ECC_ENABLED && !NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_OPTIGA)

/*lint -save -e91 */

#if NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP160R1)

// ECDH - SECP160R1 - Random test vectors
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_random, test_vector_ecdh_t test_vector_ecdh_secp160r1_random) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp160r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp160r1 valid"
};

// ECDH - GEC 2: Test Vectors for SEC 1
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_full, test_vector_ecdh_t test_vector_ecdh_full_secp160r1_1) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp160r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp160r1",
    .p_initiater_priv           = "aa374ffc3ce144e6b073307972cb6d57b2a4e982",
    .p_responder_priv           = "45fb58a92a17ad4b15101c66e74f277e2b460866",
    .p_initiater_publ_x         = "51b4496fecc406ed0e75a24a3c03206251419dc0",
    .p_initiater_publ_y         = "c28dcb4b73a514b468d793894f381ccc1756aa6c",
    .p_responder_publ_x         = "49b41e0e9c0369c2328739d90f63d56707c6e5bc",
    .p_responder_publ_y         = "26e008b567015ed96d232a03111c3edc0e9c8f83",
    .p_expected_shared_secret   = "ca7c0f8c3ffa87a96e1b74ac8e6af594347bb40a"
};

#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP160R1)

#if NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP160R2)

// ECDH - SECP160R2 - Random test vectors
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_random, test_vector_ecdh_t test_vector_ecdh_secp160r2_random) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp160r2_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp160r2 valid"
};

#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP160R2)

#if NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP192R1)

// ECDH - SECP192R1 - Random test vectors
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_random, test_vector_ecdh_t test_vector_ecdh_secp192r1_random) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp192r1 valid"
};

// ECDH - NIST CAVS 14.1 P-192 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_simple, test_vector_ecdh_t test_vector_ecdh_secp192r1_1) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp192r1 valid 1",
    .p_responder_priv           = "f17d3fea367b74d340851ca4270dcb24c271f445bed9d527",
    .p_initiater_publ_x         = "42ea6dd9969dd2a61fea1aac7f8e98edcc896c6e55857cc0",
    .p_initiater_publ_y         = "dfbe5d7c61fac88b11811bde328e8a0d12bf01a9d204b523",
    .p_expected_shared_secret   = "803d8ab2e5b6e6fca715737c3a82f7ce3c783124f6d51cd0"
};

// ECDH - NIST CAVS 14.1 P-192 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_simple, test_vector_ecdh_t test_vector_ecdh_secp192r1_2) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp192r1 valid 2",
    .p_responder_priv           = "56e853349d96fe4c442448dacb7cf92bb7a95dcf574a9bd5",
    .p_initiater_publ_x         = "deb5712fa027ac8d2f22c455ccb73a91e17b6512b5e030e7",
    .p_initiater_publ_y         = "7e2690a02cc9b28708431a29fb54b87b1f0c14e011ac2125",
    .p_expected_shared_secret   = "c208847568b98835d7312cef1f97f7aa298283152313c29d"
};

// ECDH - NIST CAVS 14.1 P-192 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_simple, test_vector_ecdh_t test_vector_ecdh_secp192r1_3) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp192r1 valid 3",
    .p_responder_priv           = "c6ef61fe12e80bf56f2d3f7d0bb757394519906d55500949",
    .p_initiater_publ_x         = "4edaa8efc5a0f40f843663ec5815e7762dddc008e663c20f",
    .p_initiater_publ_y         = "0a9f8dc67a3e60ef6d64b522185d03df1fc0adfd42478279",
    .p_expected_shared_secret   = "87229107047a3b611920d6e3b2c0c89bea4f49412260b8dd"
};

