OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_ecdh.c
// ECDH - NIST CAVS 14.1 P-192 - Count 3
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_simple, test_vector_ecdh_t test_vector_ecdh_secp192r1_4) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp192r1 valid 4",
    .p_responder_priv           = "e6747b9c23ba7044f38ff7e62c35e4038920f5a0163d3cda",
    .p_initiater_publ_x         = "8887c276edeed3e9e866b46d58d895c73fbd80b63e382e88",
    .p_initiater_publ_y         = "04c5097ba6645e16206cfb70f7052655947dd44a17f1f9d5",
    .p_expected_shared_secret   = "eec0bed8fc55e1feddc82158fd6dc0d48a4d796aaf47d46c"
};

// ECDH - NIST CAVS 14.1 P-192 - Count 4
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_simple, test_vector_ecdh_t test_vector_ecdh_secp192r1_5) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp192r1 valid 5",
    .p_responder_priv           = "beabedd0154a1afcfc85d52181c10f5eb47adc51f655047d",
    .p_initiater_publ_x         = "0d045f30254adc1fcefa8a5b1f31bf4e739dd327cd18d594",
    .p_initiater_publ_y         = "542c314e41427c08278a08ce8d7305f3b5b849c72d8aff73",
    .p_expected_shared_secret   = "716e743b1b37a2cd8479f0a3d5a74c10ba2599be18d7e2f4"
};

// ECDH - NIST CAVS 14.1 P-192 - Invalid public key test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_simple, test_vector_ecdh_t test_vector_ecdh_secp192r1_inv_q) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp192r1_curve_info,
#if NRF_CRYPTO_BACKEND_MBEDTLS_ENABLED
    .expected_err_code          = NRF_ERROR_CRYPTO_ECC_KEY_NOT_INITIALIZED,
#else
    .expected_err_code          = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .expected_result            = EXPECTED_TO_FAIL,
    .p_test_vector_name         = "secp192r1 invalid public key",
    .p_responder_priv           = "beabedd0154a1afcfc85d52181c10f5eb47adc51f655047d",
    .p_initiater_publ_x         = "1d045f30254adc1fcefa8a5b1f31bf4e739dd327cd18d594",
    .p_initiater_publ_y         = "542c314e41427c08278a08ce8d7305f3b5b849c72d8aff73",
    .p_expected_shared_secret   = "716e743b1b37a2cd8479f0a3d5a74c10ba2599be18d7e2f4"
};

// ECDH - NIST CAVS 14.1 P-192 - Invalid private key test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_simple, test_vector_ecdh_t test_vector_ecdh_secp192r1_inv_d) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_FAIL,
    .p_test_vector_name         = "secp192r1 invalid private key",
    .p_responder_priv           = "ceabedd0154a1afcfc85d52181c10f5eb47adc51f655047d",
    .p_initiater_publ_x         = "0d045f30254adc1fcefa8a5b1f31bf4e739dd327cd18d594",
    .p_initiater_publ_y         = "542c314e41427c08278a08ce8d7305f3b5b849c72d8aff73",
    .p_expected_shared_secret   = "716e743b1b37a2cd8479f0a3d5a74c10ba2599be18d7e2f4"
};

// ECDH - NIST CAVS 14.1 P-192 - Invalid shared secret test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_simple, test_vector_ecdh_t test_vector_ecdh_secp192r1_inv_ss) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_FAIL,
    .p_test_vector_name         = "secp192r1 invalid shared secret",
    .p_responder_priv           = "beabedd0154a1afcfc85d52181c10f5eb47adc51f655047d",
    .p_initiater_publ_x         = "0d045f30254adc1fcefa8a5b1f31bf4e739dd327cd18d594",
    .p_initiater_publ_y         = "542c314e41427c08278a08ce8d7305f3b5b849c72d8aff73",
    .p_expected_shared_secret   = "816e743b1b37a2cd8479f0a3d5a74c10ba2599be18d7e2f4"
};
#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP192R1)

#if NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP224R1)

// ECDH - SECP224R1 - Random test vectors
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_random, test_vector_ecdh_t test_vector_ecdh_secp224r1_random) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp224r1 valid"
};

// ECDH - NIST CAVS 14.1 P-224 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_simple, test_vector_ecdh_t test_vector_ecdh_secp224r1_1) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp224r1 valid 1",
    .p_responder_priv           = "8346a60fc6f293ca5a0d2af68ba71d1dd389e5e40837942df3e43cbd",
    .p_initiater_publ_x         = "af33cd0629bc7e996320a3f40368f74de8704fa37b8fab69abaae280",
    .p_initiater_publ_y         = "882092ccbba7930f419a8a4f9bb16978bbc3838729992559a6f2e2d7",
    .p_expected_shared_secret   = "7d96f9a3bd3c05cf5cc37feb8b9d5209d5c2597464dec3e9983743e8"
};

// ECDH - NIST CAVS 14.1 P-224 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_simple, test_vector_ecdh_t test_vector_ecdh_secp224r1_2) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp224r1 valid 2",
    .p_responder_priv           = "043cb216f4b72cdf7629d63720a54aee0c99eb32d74477dac0c2f73d",
    .p_initiater_publ_x         = "13bfcd4f8e9442393cab8fb46b9f0566c226b22b37076976f0617a46",
    .p_initiater_publ_y         = "eeb2427529b288c63c2f8963c1e473df2fca6caa90d52e2f8db56dd4",
    .p_expected_shared_secret   = "ee93ce06b89ff72009e858c68eb708e7bc79ee0300f73bed69bbca09"
};

// ECDH - NIST CAVS 14.1 P-224 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_simple, test_vector_ecdh_t test_vector_ecdh_secp224r1_3) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp224r1 valid 3",
    .p_responder_priv           = "5ad0dd6dbabb4f3c2ea5fe32e561b2ca55081486df2c7c15c9622b08",
    .p_initiater_publ_x         = "756dd806b9d9c34d899691ecb45b771af468ec004486a0fdd283411e",
    .p_initiater_publ_y         = "4d02c2ca617bb2c5d9613f25dd72413d229fd2901513aa29504eeefb",
    .p_expected_shared_secret   = "3fcc01e34d4449da2a974b23fc36f9566754259d39149790cfa1ebd3"
};

// ECDH - NIST CAVS 14.1 P-224 - Count 3
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_simple, test_vector_ecdh_t test_vector_ecdh_secp224r1_4) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp224r1 valid 4",
    .p_responder_priv           = "0aa6ff55a5d820efcb4e7d10b845ea3c9f9bc5dff86106db85318e22",
    .p_initiater_publ_x         = "0f537bf1c1122c55656d25e8aa8417e0b44b1526ae0523144f9921c4",
    .p_initiater_publ_y         = "f79b26d30e491a773696cc2c79b4f0596bc5b9eebaf394d162fb8684",
    .p_expected_shared_secret   = "49129628b23afcef48139a3f6f59ff5e9811aa746aa4ff33c24bb940"
};

