OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_ecdh.c
// ECDH - NIST CAVS 14.1 P-224 - Count 4
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_simple, test_vector_ecdh_t test_vector_ecdh_secp224r1_5) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp224r1 valid 5",
    .p_responder_priv           = "efe6e6e25affaf54c98d002abbc6328da159405a1b752e32dc23950a",
    .p_initiater_publ_x         = "2b3631d2b06179b3174a100f7f57131eeea8947be0786c3dc64b2239",
    .p_initiater_publ_y         = "83de29ae3dad31adc0236c6de7f14561ca2ea083c5270c78a2e6cbc0",
    .p_expected_shared_secret   = "fcdc69a40501d308a6839653a8f04309ec00233949522902ffa5eac6"
};

// ECDH - NIST CAVS 14.1 P-224 - Invalid public key test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_simple, test_vector_ecdh_t test_vector_ecdh_secp224r1_inv_q) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp224r1_curve_info,
#if NRF_CRYPTO_BACKEND_MBEDTLS_ENABLED
    .expected_err_code          = NRF_ERROR_CRYPTO_ECC_KEY_NOT_INITIALIZED,
#else
    .expected_err_code          = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .expected_result            = EXPECTED_TO_FAIL,
    .p_test_vector_name         = "secp224r1 invalid public key",
    .p_responder_priv           = "efe6e6e25affaf54c98d002abbc6328da159405a1b752e32dc23950a",
    .p_initiater_publ_x         = "3b3631d2b06179b3174a100f7f57131eeea8947be0786c3dc64b2239",
    .p_initiater_publ_y         = "83de29ae3dad31adc0236c6de7f14561ca2ea083c5270c78a2e6cbc0",
    .p_expected_shared_secret   = "fcdc69a40501d308a6839653a8f04309ec00233949522902ffa5eac6"
};

// ECDH - NIST CAVS 14.1 P-224 - Invalid private key test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_simple, test_vector_ecdh_t test_vector_ecdh_secp224r1_inv_d) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_FAIL,
    .p_test_vector_name         = "secp224r1 invalid private key",
    .p_responder_priv           = "ffe6e6e25affaf54c98d002abbc6328da159405a1b752e32dc23950a",
    .p_initiater_publ_x         = "2b3631d2b06179b3174a100f7f57131eeea8947be0786c3dc64b2239",
    .p_initiater_publ_y         = "83de29ae3dad31adc0236c6de7f14561ca2ea083c5270c78a2e6cbc0",
    .p_expected_shared_secret   = "fcdc69a40501d308a6839653a8f04309ec00233949522902ffa5eac6"
};

// ECDH - NIST CAVS 14.1 P-224 - Invalid shared secret test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_simple, test_vector_ecdh_t test_vector_ecdh_secp224r1_inv_ss) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_FAIL,
    .p_test_vector_name         = "secp224r1 invalid shared secret",
    .p_responder_priv           = "efe6e6e25affaf54c98d002abbc6328da159405a1b752e32dc23950a",
    .p_initiater_publ_x         = "2b3631d2b06179b3174a100f7f57131eeea8947be0786c3dc64b2239",
    .p_initiater_publ_y         = "83de29ae3dad31adc0236c6de7f14561ca2ea083c5270c78a2e6cbc0",
    .p_expected_shared_secret   = "0cdc69a40501d308a6839653a8f04309ec00233949522902ffa5eac6"
};
#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP224R1)

#if NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP256R1)

// ECDH - SECP256R1 - Random test vectors
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_random, test_vector_ecdh_t test_vector_ecdh_secp256r1_random) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp256r1 valid"
};

// ECDH - RFC 5903 256-Bit Random ECP Group
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_full, test_vector_ecdh_t test_vector_ecdh_secp256r1_full) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp256r1",
    .p_initiater_priv           = "C88F01F510D9AC3F70A292DAA2316DE544E9AAB8AFE84049C62A9C57862D1433",
    .p_responder_priv           = "C6EF9C5D78AE012A011164ACB397CE2088685D8F06BF9BE0B283AB46476BEE53",
    .p_initiater_publ_x         = "DAD0B65394221CF9B051E1FECA5787D098DFE637FC90B9EF945D0C3772581180",
    .p_initiater_publ_y         = "5271A0461CDB8252D61F1C456FA3E59AB1F45B33ACCF5F58389E0577B8990BB3",
    .p_responder_publ_x         = "D12DFB5289C8D4F81208B70270398C342296970A0BCCB74C736FC7554494BF63",
    .p_responder_publ_y         = "56FBF3CA366CC23E8157854C13C58D6AAC23F046ADA30F8353E74F33039872AB",
    .p_expected_shared_secret   = "D6840F6B42F6EDAFD13116E0E12565202FEF8E9ECE7DCE03812464D04B9442DE"
};


// ECDH - NIST CAVS 14.1 P-256 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_simple, test_vector_ecdh_t test_vector_ecdh_secp256r1_1) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp256r1 valid 1",
    .p_responder_priv           = "7d7dc5f71eb29ddaf80d6214632eeae03d9058af1fb6d22ed80badb62bc1a534",
    .p_initiater_publ_x         = "700c48f77f56584c5cc632ca65640db91b6bacce3a4df6b42ce7cc838833d287",
    .p_initiater_publ_y         = "db71e509e3fd9b060ddb20ba5c51dcc5948d46fbf640dfe0441782cab85fa4ac",
    .p_expected_shared_secret   = "46fc62106420ff012e54a434fbdd2d25ccc5852060561e68040dd7778997bd7b"
};

// ECDH - NIST CAVS 14.1 P-256 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_simple, test_vector_ecdh_t test_vector_ecdh_secp256r1_2) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp256r1 valid 2",
    .p_responder_priv           = "38f65d6dce47676044d58ce5139582d568f64bb16098d179dbab07741dd5caf5",
    .p_initiater_publ_x         = "809f04289c64348c01515eb03d5ce7ac1a8cb9498f5caa50197e58d43a86a7ae",
    .p_initiater_publ_y         = "b29d84e811197f25eba8f5194092cb6ff440e26d4421011372461f579271cda3",
    .p_expected_shared_secret   = "057d636096cb80b67a8c038c890e887d1adfa4195e9b3ce241c8a778c59cda67"
};

// ECDH - NIST CAVS 14.1 P-256 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_simple, test_vector_ecdh_t test_vector_ecdh_secp256r1_3) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp256r1 valid 3",
    .p_responder_priv           = "1accfaf1b97712b85a6f54b148985a1bdc4c9bec0bd258cad4b3d603f49f32c8",
    .p_initiater_publ_x         = "a2339c12d4a03c33546de533268b4ad667debf458b464d77443636440ee7fec3",
    .p_initiater_publ_y         = "ef48a3ab26e20220bcda2c1851076839dae88eae962869a497bf73cb66faf536",
    .p_expected_shared_secret   = "2d457b78b4614132477618a5b077965ec90730a8c81a1c75d6d4ec68005d67ec"
};

// ECDH - NIST CAVS 14.1 P-256 - Count 3
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_simple, test_vector_ecdh_t test_vector_ecdh_secp256r1_4) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp256r1 valid 4",
    .p_responder_priv           = "207c43a79bfee03db6f4b944f53d2fb76cc49ef1c9c4d34d51b6c65c4db6932d",
    .p_initiater_publ_x         = "df3989b9fa55495719b3cf46dccd28b5153f7808191dd518eff0c3cff2b705ed",
    .p_initiater_publ_y         = "422294ff46003429d739a33206c8752552c8ba54a270defc06e221e0feaf6ac4",
    .p_expected_shared_secret   = "96441259534b80f6aee3d287a6bb17b5094dd4277d9e294f8fe73e48bf2a0024"
};

// ECDH - NIST CAVS 14.1 P-256 - Count 4
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_simple, test_vector_ecdh_t test_vector_ecdh_secp256r1_5) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp256r1 valid 5",
    .p_responder_priv           = "59137e38152350b195c9718d39673d519838055ad908dd4757152fd8255c09bf",
    .p_initiater_publ_x         = "41192d2813e79561e6a1d6f53c8bc1a433a199c835e141b05a74a97b0faeb922",
    .p_initiater_publ_y         = "1af98cc45e98a7e041b01cf35f462b7562281351c8ebf3ffa02e33a0722a1328",
    .p_expected_shared_secret   = "19d44c8d63e8e8dd12c22a87b8cd4ece27acdde04dbf47f7f27537a6999a8e62"
};

