OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_ecdh.c
#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP521R1)

#if NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_CURVE25519)

const char ecdh_curve25519_initiater_priv[]         = { "77076d0a7318a57d3c16c17251b26645df4c2f87ebc0992ab177fba51db92c2a" };
const char ecdh_curve25519_responder_priv[]         = { "5dab087e624a8a4b79e17f8b83800ee66f3bb1292618b6fd1c2f8b27ff88e0eb" };
const char ecdh_curve25519_initiater_publ_x[]       = { "8520f0098930a754748b7ddcb43ef75a" };
const char ecdh_curve25519_initiater_publ_y[]       = { "0dbf3a0d26381af4eba4a98eaa9b4e6a" };
const char ecdh_curve25519_responder_publ_x[]       = { "de9edb7d7b7dc1b4d35b61c2ece43537" };
const char ecdh_curve25519_responder_publ_y[]       = { "3f8343c85b78674dadfc7e146f882b4f" };
const char ecdh_curve25519_expected_shared_secret[] = { "4a5d9d5ba4ce2de1728e3bf480350f25e07e21c947d19e3376f09b3c1e161742" };

// ECDH - RFC 7748 - 6.1. Curve25519
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_full, test_vector_ecdh_t test_vector_ecdh_curve25519_full_1) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_curve25519_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "curve25519",
    .p_initiater_priv           = ecdh_curve25519_initiater_priv,
    .p_responder_priv           = ecdh_curve25519_responder_priv,
    .p_initiater_publ_x         = ecdh_curve25519_initiater_publ_x,
    .p_initiater_publ_y         = ecdh_curve25519_initiater_publ_y,
    .p_responder_publ_x         = ecdh_curve25519_responder_publ_x,
    .p_responder_publ_y         = ecdh_curve25519_responder_publ_y,
    .p_expected_shared_secret   = ecdh_curve25519_expected_shared_secret
};

// ECDH - Based on RFC 7748 - 6.1. Curve25519 Test Vector
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_full, test_vector_ecdh_t test_vector_ecdh_curve25519_full_inv_priv_key) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_curve25519_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_FAIL,
    .p_test_vector_name         = "curve25519 invalid private key",
    .p_initiater_priv           = "87076d0a7318a57d3c16c17251b26645df4c2f87ebc0992ab177fba51db92c2a",
    .p_responder_priv           = "6dab087e624a8a4b79e17f8b83800ee66f3bb1292618b6fd1c2f8b27ff88e0eb",
    .p_initiater_publ_x         = ecdh_curve25519_initiater_publ_x,
    .p_initiater_publ_y         = ecdh_curve25519_initiater_publ_y,
    .p_responder_publ_x         = ecdh_curve25519_responder_publ_x,
    .p_responder_publ_y         = ecdh_curve25519_responder_publ_y,
    .p_expected_shared_secret   = ecdh_curve25519_expected_shared_secret
};

// ECDH - Based on RFC 7748 - 6.1. Curve25519 Test Vector
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_full, test_vector_ecdh_t test_vector_ecdh_curve25519_full_inv_publ_x_key) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_curve25519_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_FAIL,
    .p_test_vector_name         = "curve25519 invalid public X key",
    .p_initiater_priv           = ecdh_curve25519_initiater_priv,
    .p_responder_priv           = ecdh_curve25519_responder_priv,
    .p_initiater_publ_x         = "9520f0098930a754748b7ddcb43ef75a",
    .p_initiater_publ_y         = ecdh_curve25519_initiater_publ_y,
    .p_responder_publ_x         = ecdh_curve25519_responder_publ_x,
    .p_responder_publ_y         = ecdh_curve25519_responder_publ_y,
    .p_expected_shared_secret   = ecdh_curve25519_expected_shared_secret
};

// ECDH - Based on RFC 7748 - 6.1. Curve25519 Test Vector
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_deterministic_full, test_vector_ecdh_t test_vector_ecdh_curve25519_full_inv_publ_y_key) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_curve25519_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_FAIL,
    .p_test_vector_name         = "curve25519 invalid public Y key",
    .p_initiater_priv           = ecdh_curve25519_initiater_priv,
    .p_responder_priv           = ecdh_curve25519_responder_priv,
    .p_initiater_publ_x         = ecdh_curve25519_initiater_publ_x,
    .p_initiater_publ_y         = "1dbf3a0d26381af4eba4a98eaa9b4e6a",
    .p_responder_publ_x         = ecdh_curve25519_responder_publ_x,
    .p_responder_publ_y         = ecdh_curve25519_responder_publ_y,
    .p_expected_shared_secret   = ecdh_curve25519_expected_shared_secret
};

#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_CURVE25519)

#if NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP160K1)

// ECDH - SECP160K1 - Random test vectors
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_random, test_vector_ecdh_t test_vector_ecdh_secp160k1_random) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp160k1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp160k1 valid"
};

#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP160K1)

#if NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP192K1)

// ECDH - SECP192K1 - Random test vectors
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_random, test_vector_ecdh_t test_vector_ecdh_secp192k1_random) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp192k1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp192k1 valid"
};
#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP192K1)

#if NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP224K1)

// ECDH - SECP224K1 - Random test vectors
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_random, test_vector_ecdh_t test_vector_ecdh_secp224k1_random) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp224k1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp224k1 valid"
};
#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP224K1)

#if NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP256K1)

// ECDH - SECP256K1 - Random test vectors
NRF_SECTION_ITEM_REGISTER(test_vector_ecdh_data_random, test_vector_ecdh_t test_vector_ecdh_secp256k1_random) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp256k1_curve_info,
    .expected_err_code          = NRF_SUCCESS,
    .expected_result            = EXPECTED_TO_PASS,
    .p_test_vector_name         = "secp256k1 valid"
};
#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP256K1)

